УТ_для_edt/src/Documents/CRM_РассылкаЭлектронныхПисем/CRM_РассылкаЭлектронныхПисем.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>CRM_РассылкаЭлектронныхПисем</name>
  <basedOn>Catalog.МаркетинговыеМероприятия</basedOn>
  <posting>Deny</posting>
  <attributes>
    <name>CRM_ХранилищеНастроекКомпоновкиДанных</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресХранилищаФайлов</name>
    <comment>Служебный реквизит, используется для механизма шаблонов</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Важность</name>
    <type>
      <types>EnumRef.ВариантыВажностиВзаимодействия</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаВыполненияРассылки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьВложения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьИзменения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Завершена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Запущена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИзHTMLФайла</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Кодировка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>CatalogRef.МаркетинговыеМероприятия</types>
      <types>TaskRef.ЗадачаИсполнителя</types>
      <types>BusinessProcessRef.CRM_БизнесПроцесс</types>
      <types>DocumentRef.НазначениеОпросов</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтправительПредставление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтправлятьПисьмаСразу</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеЗаказчик</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>СервисРассылки</name>
    <type>
      <types>CatalogRef.CRM_СервисыРассылок</types>
    </type>
  </attributes>
  <attributes>
    <name>Текст</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстHTML</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Тема</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипТекста</name>
    <type>
      <types>EnumRef.ТипыТекстовЭлектронныхПисем</types>
    </type>
  </attributes>
  <attributes>
    <name>УчетнаяЗапись</name>
    <type>
      <types>CatalogRef.УчетныеЗаписиЭлектроннойПочты</types>
    </type>
  </attributes>
  <attributes>
    <name>Шаблон</name>
    <type>
      <types>CatalogRef.CRM_ШаблоныОбъектов</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Получатели</name>
    <attributes>
      <name>Партнер</name>
      <type>
        <types>CatalogRef.Пользователи</types>
        <types>CatalogRef.Партнеры</types>
        <types>CatalogRef.ФизическиеЛица</types>
        <types>CatalogRef.CRM_ПотенциальныеКлиенты</types>
      </type>
    </attributes>
    <attributes>
      <name>КонтактноеЛицо</name>
      <type>
        <types>CatalogRef.КонтактныеЛицаПартнеров</types>
      </type>
    </attributes>
    <attributes>
      <name>Адрес</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПредставлениеАдреса</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Принадлежность</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПартнерСтрокой</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>УдалитьСвоиЛица</name>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Адрес</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПредставлениеАдреса</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>УдалитьФизЛица</name>
    <attributes>
      <name>ФизЛицо</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>Адрес</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПредставлениеАдреса</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НаборыЗначенийДоступа</name>
    <attributes>
      <name>НомерНабора</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеДоступа</name>
      <comment>Незаполненные значения нужно допустить, чтобы избежать ошибок при записи проверяемых объектов</comment>
      <type>
        <types>DefinedType.ЗначениеДоступа</types>
      </type>
    </attributes>
    <attributes>
      <name>Уточнение</name>
      <type>
        <types>CatalogRef.ИдентификаторыОбъектовМетаданных</types>
      </type>
    </attributes>
    <attributes>
      <name>Чтение</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Изменение</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

УТ_для_edt/src/InformationRegisters/ПредметыПапкиВзаимодействий/ПредметыПапкиВзаимодействий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПредметыПапкиВзаимодействий</name>
  <resources>
    <name>Предмет</name>
    <type>
      <types>DefinedType.ПредметВзаимодействия</types>
    </type>
  </resources>
  <resources>
    <name>ПапкаЭлектронногоПисьма</name>
    <type>
      <types>CatalogRef.ПапкиЭлектронныхПисем</types>
    </type>
  </resources>
  <resources>
    <name>Рассмотрено</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>РассмотретьПосле</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <dimensions>
    <name>Взаимодействие</name>
    <type>
      <types>DocumentRef.ЭлектронноеПисьмоИсходящее</types>
      <types>DocumentRef.ЗапланированноеВзаимодействие</types>
      <types>DocumentRef.ЭлектронноеПисьмоВходящее</types>
      <types>DocumentRef.ТелефонныйЗвонок</types>
      <types>DocumentRef.Встреча</types>
      <types>DocumentRef.СообщениеSMS</types>
      <types>DocumentRef.УдалитьCRM_Событие</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt/src/InformationRegisters/CRM_СтатусыПисемEmailРассылки/CRM_СтатусыПисемEmailРассылки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>CRM_СтатусыПисемEmailРассылки</name>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.CRM_СтатусыПисемEmailРассылки</types>
    </type>
  </resources>
  <attributes>
    <name>СтатусСтрокой</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Письмо</name>
    <type>
      <types>DocumentRef.ЭлектронноеПисьмоИсходящее</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt/src/Enums/CRM_СтатусыПисемEmailРассылки/CRM_СтатусыПисемEmailРассылки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>CRM_СтатусыПисемEmailРассылки</name>
  <enumValues>
    <name>Отправлено</name>
  </enumValues>
  <enumValues>
    <name>Доставлено</name>
  </enumValues>
  <enumValues>
    <name>Отправляется</name>
  </enumValues>
  <enumValues>
    <name>Прочитано</name>
  </enumValues>
  <enumValues>
    <name>ПереходПоСсылке</name>
  </enumValues>
  <enumValues>
    <name>НеДоставлено</name>
  </enumValues>
  <enumValues>
    <name>ПолучательОтписалсяОтРассылки</name>
  </enumValues>
  <enumValues>
    <name>ОшибкаОтправки</name>
  </enumValues>
</mdclass:Enum>

УТ_для_edt/src/Enums/CRM_ВидыПапокЭлектроннойПочты/CRM_ВидыПапокЭлектроннойПочты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>CRM_ВидыПапокЭлектроннойПочты</name>
  <enumValues>
    <name>Входящие</name>
  </enumValues>
  <enumValues>
    <name>Исходящие</name>
  </enumValues>
  <enumValues>
    <name>Отправленные</name>
  </enumValues>
  <enumValues>
    <name>Черновики</name>
  </enumValues>
  <enumValues>
    <name>Удаленные</name>
  </enumValues>
  <enumValues>
    <name>Обработанные</name>
  </enumValues>
  <enumValues>
    <name>НежелательнаяПочта</name>
  </enumValues>
</mdclass:Enum>

УТ_для_edt/src/Documents/CRM_РассылкаЭлектронныхПисем/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область СлужебныйПрограммныйИнтерфейс

Функция ПолучитьКонтакты(Ссылка) Экспорт
	
	Результат = Новый Массив;
	Возврат Результат;
	
КонецФункции

Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	
	
КонецПроцедуры

Функция СформироватьПисьма(Рассылка) Экспорт
	
	Если Рассылка.СервисРассылки <> Справочники.CRM_СервисыРассылок.SMTP И НЕ CRM_ИнтеграцияССервисамиРассылок.ПроверитьАдресУчетнойЗаписи(Рассылка.СервисРассылки, Рассылка.УчетнаяЗапись.АдресЭлектроннойПочты) Тогда
		Возврат Ложь;
	КонецЕсли;
	НачатьТранзакцию();
	Попытка
		СоздалиХотьОдноПисьмо = Ложь;
		ТабПолучателей = СформироватьТаблицуПолучателей(Рассылка);
		
		ТаблицаАвтотекста = ПолучитьТаблицуАвтотекста();
		
		Для Каждого СтрокаПолучателя Из ТабПолучателей Цикл
			Если ЗначениеЗаполнено(СтрокаПолучателя.Адрес) Тогда
				
				НовоеЭлектронноеПисьмо = СоздатьЗаполнитьЭлектронноеПисьмоИсходящее(Рассылка, СтрокаПолучателя, ТаблицаАвтотекста);
				НовоеЭлектронноеПисьмо.Записать();
				
				Взаимодействия.УстановитьПредмет(НовоеЭлектронноеПисьмо.Ссылка, Рассылка);
				Взаимодействия.УстановитьПапкуЭлектронногоПисьма(НовоеЭлектронноеПисьмо.Ссылка,
					CRM_УправлениеЭлектроннойПочтой.ПолучитьПапкуЭлектронногоПисьма(Рассылка.УчетнаяЗапись,"Исходящие"), Ложь);
				
				СоздалиХотьОдноПисьмо = Истина;
			КонецЕсли;
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
		
		Возврат СоздалиХотьОдноПисьмо;
	Исключение
		ОтменитьТранзакцию();
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ЕстьОшибки = Истина;
		Возврат Ложь;
	КонецПопытки;
	
КонецФункции

Процедура ПолучитьНеОтправленныеПисьмаИОтправить(Рассылка, бОтправитьСразу) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЭлектронноеПисьмоИсходящее.Ссылка
	               |ИЗ
	               |	РегистрСведений.ПредметыПапкиВзаимодействий КАК ПредметыПапкиВзаимодействий
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЭлектронноеПисьмоИсходящее КАК ЭлектронноеПисьмоИсходящее
	               |		ПО ПредметыПапкиВзаимодействий.Взаимодействие = ЭлектронноеПисьмоИсходящее.Ссылка
	               |ГДЕ
	               |	ПредметыПапкиВзаимодействий.Предмет = &Ссылка
	               |	И НЕ ЭлектронноеПисьмоИсходящее.СтатусПисьма = ЗНАЧЕНИЕ(Перечисление.СтатусыИсходящегоЭлектронногоПисьма.Отправлено)
	               |	И НЕ ЭлектронноеПисьмоИсходящее.ПометкаУдаления";
	Запрос.УстановитьПараметр("Ссылка", Рассылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ПисьмоОбъект						= Выборка.Ссылка.ПолучитьОбъект();
		ПисьмоОбъект.СтатусПисьма			= Перечисления.СтатусыИсходящегоЭлектронногоПисьма.Исходящее;
		ПисьмоОбъект.ОбменДанными.Загрузка	= Истина;
		ПисьмоОбъект.Записать();
		
		// Если отправляем сразу
		Если бОтправитьСразу Тогда
			Если Рассылка.СервисРассылки = Справочники.CRM_СервисыРассылок.SMTP Тогда
				Результат = ВыполнитьОтправку(Выборка.Ссылка, Рассылка.СервисРассылки);
			ИначеЕсли ЗначениеЗаполнено(Рассылка.СервисРассылки) Тогда
				ПараметрыСервиса = CRM_ИнтеграцияССервисамиРассылок.НастройкиСервиса(Рассылка.СервисРассылки);
				Результат = ВыполнитьОтправку(Выборка.Ссылка, Рассылка.СервисРассылки, ПараметрыСервиса);
			КонецЕсли;
			Если ЗначениеЗаполнено(Результат) Тогда
				ЕстьОшибки = Истина;
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Результат + "  (" + Строка(Выборка.Ссылка)+")");
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ПолучитьНеОтправленныеПисьмаИСкорректировать(Рассылка, CRM_ИзмененоСодержаниеРассылки, CRM_ИзмененОтправитель, CRM_ИзмененаТема, CRM_ИзмененыВложения) Экспорт
	
	// Получим актуальную таблицу получателей.
	ТабПолучателей = СформироватьТаблицуПолучателей(Рассылка);
	ТабПолучателей.Колонки.Добавить("Обработано",Новый ОписаниеТипов("Булево"));
	
	// Создадим таблицу для неактуальных писем.
	ТаблицаНеактуальныхПисем = Новый ТаблицаЗначений;
	ТаблицаНеактуальныхПисем.Колонки.Добавить("Ссылка",Новый ОписаниеТипов("ДокументСсылка.ЭлектронноеПисьмоИсходящее"));
	
	// Запросом получим ранее созданные письма.
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ЭлектронноеПисьмоИсходящее.Ссылка
	|ИЗ
    |	РегистрСведений.ПредметыПапкиВзаимодействий КАК ПредметыПапкиВзаимодействий
    |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЭлектронноеПисьмоИсходящее КАК ЭлектронноеПисьмоИсходящее
    |		ПО ПредметыПапкиВзаимодействий.Взаимодействие = ЭлектронноеПисьмоИсходящее.Ссылка
	|ГДЕ
	|	ПредметыПапкиВзаимодействий.Предмет = &Ссылка
	|	И НЕ ЭлектронноеПисьмоИсходящее.СтатусПисьма = ЗНАЧЕНИЕ(Перечисление.СтатусыИсходящегоЭлектронногоПисьма.Отправлено)
	|	И НЕ ЭлектронноеПисьмоИсходящее.CRM_РазрешеноРедактирование
	|	И (НЕ ЭлектронноеПисьмоИсходящее.ПометкаУдаления)";
	Запрос.УстановитьПараметр("Ссылка", Рассылка);
		
	Выборка = Запрос.Выполнить().Выбрать();
	ТаблицаАвтотекста = ПолучитьТаблицуАвтотекста();
	
	Пока Выборка.Следующий() Цикл
		МассивПолучателей = ТабПолучателей.НайтиСтроки(Новый Структура("Партнер", Выборка.Ссылка.ПолучателиПисьма[0].Контакт));
		
		// Если среди получателей не нашли, то данное письмо неактуально.
		Если МассивПолучателей.Количество() = 0 Тогда
			НоваяСтрока = ТаблицаНеактуальныхПисем.Добавить();
			НоваяСтрока.Ссылка = Выборка.Ссылка;
			Продолжить;
		КонецЕсли;
		
		// Перенесем изменения в письмо.
		НачатьТранзакцию();
		Попытка
			МассивПолучателей[0].Обработано = Истина;
			
			ЭлектронноеПисьмо			= Выборка.Ссылка.ПолучитьОбъект();
			
			КонтактПисьма				= Выборка.Ссылка.ПолучателиПисьма[0].Контакт;
			
			ИзмененАдресПолучателя = Ложь;
			
			// Если изменили адрес почты, то меняем и в письме.
			Если НЕ Выборка.Ссылка.ПолучателиПисьма[0].Адрес = МассивПолучателей[0].Адрес Тогда
				ЭлектронноеПисьмо.ПолучателиПисьма[0].Адрес			= МассивПолучателей[0].Адрес;
				ЭлектронноеПисьмо.ПолучателиПисьма[0].Представление	= МассивПолучателей[0].ПредставлениеАдреса;
				ЭлектронноеПисьмо.СписокПолучателейПисьма			= МассивПолучателей[0].ПредставлениеАдреса;
				
				АдресПисьма					= МассивПолучателей[0].Адрес;
				АдресПисьмаПредставление	= МассивПолучателей[0].ПредставлениеАдреса;
				
				ИзмененАдресПолучателя = Истина;
			Иначе
				АдресПисьма					= Выборка.Ссылка.ПолучателиПисьма[0].Адрес;
				АдресПисьмаПредставление	= Выборка.Ссылка.ПолучателиПисьма[0].Представление;
			КонецЕсли;
			
			СтрокаПолучателя = Новый Структура;
			СтрокаПолучателя.Вставить("НомерСтроки"			, 0);
			
			Если ТипЗнч(КонтактПисьма) = Тип("СправочникСсылка.Партнеры") ИЛИ ТипЗнч(КонтактПисьма) = Тип("СправочникСсылка.Пользователи") 
			ИЛИ ТипЗнч(КонтактПисьма) = Тип("СправочникСсылка.ФизическиеЛица") Тогда
				СтрокаПолучателя.Вставить("Партнер"			,КонтактПисьма);
				СтрокаПолучателя.Вставить("КонтактноеЛицо"	,Справочники.КонтактныеЛицаПартнеров.ПустаяСсылка());
			ИначеЕсли ТипЗнч(КонтактПисьма) = Тип("СправочникСсылка.КонтактныеЛицаПартнеров") Тогда
				СтрокаПолучателя.Вставить("Партнер"			,КонтактПисьма.Владелец);
				СтрокаПолучателя.Вставить("КонтактноеЛицо"	,КонтактПисьма);
			Иначе
				СтрокаПолучателя.Вставить("Партнер"			,Неопределено);
				СтрокаПолучателя.Вставить("КонтактноеЛицо"	,Неопределено);
				СтрокаПолучателя.Вставить("ПартнерСтрокой"	, МассивПолучателей[0].ПартнерСтрокой);
			КонецЕсли;
			
			СтрокаПолучателя.Вставить("Адрес"				,АдресПисьма);
			СтрокаПолучателя.Вставить("ПредставлениеАдреса"	,АдресПисьмаПредставление);
			
			ИтоговыйТекстПисьма = СформироватьТекстПисьмаПолучателю(Рассылка.ТекстHTML, ДанныеФормированияТекстаПисьма(СтрокаПолучателя), ТаблицаАвтотекста);
			
			Если CRM_ИзмененОтправитель Тогда
				ЭлектронноеПисьмо.УчетнаяЗапись				= Рассылка.УчетнаяЗапись;
				ЭлектронноеПисьмо.ОтправительПредставление	= Рассылка.ОтправительПредставление;
			КонецЕсли;
			
			Если CRM_ИзмененоСодержаниеРассылки ИЛИ ИзмененАдресПолучателя Тогда
				ЭлектронноеПисьмо.Текст					= ИтоговыйТекстПисьма;
				ЭлектронноеПисьмо.ТекстHTML				= ИтоговыйТекстПисьма;
			КонецЕсли;
			
			Если CRM_ИзмененаТема Тогда
				ЭлектронноеПисьмо.Тема = ВернутьТему(Рассылка.Тема, ДанныеФормированияТекстаПисьма(СтрокаПолучателя), ТаблицаАвтотекста);
			КонецЕсли;
			
			Если (CRM_ИзмененоСодержаниеРассылки ИЛИ CRM_ИзмененОтправитель ИЛИ ИзмененАдресПолучателя ИЛИ CRM_ИзмененаТема) И НЕ CRM_ИзмененыВложения Тогда
				ЭлектронноеПисьмо.Записать();
			КонецЕсли;
			
			Если CRM_ИзмененоСодержаниеРассылки ИЛИ CRM_ИзмененыВложения Тогда
				ЭлектронноеПисьмо.ЕстьВложения = Рассылка.ЕстьВложения;
				ЭлектронноеПисьмо.Записать();
			КонецЕсли;
			
			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
	КонецЦикла;
	
	Для Каждого СтрокаПолучателя Из ТабПолучателей Цикл
		// Тут либо новый получатель, либо поменяли получателя.
		Если НЕ СтрокаПолучателя.Обработано Тогда
			НачатьТранзакцию();
			Попытка
				Если ЗначениеЗаполнено(СтрокаПолучателя.Адрес) Тогда
					
					НовоеЭлектронноеПисьмо = СоздатьЗаполнитьЭлектронноеПисьмоИсходящее(Рассылка, СтрокаПолучателя, ТаблицаАвтотекста);
					НовоеЭлектронноеПисьмо.Записать();
					
					Взаимодействия.УстановитьПредмет(НовоеЭлектронноеПисьмо.Ссылка, Рассылка.Ссылка);
					Взаимодействия.УстановитьПапкуЭлектронногоПисьма(НовоеЭлектронноеПисьмо.Ссылка,
					CRM_УправлениеЭлектроннойПочтой.ПолучитьПапкуЭлектронногоПисьма(Рассылка.УчетнаяЗапись,"Исходящие"), Ложь);
				КонецЕсли;
				ЗафиксироватьТранзакцию();
			Исключение
				ОтменитьТранзакцию();
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			КонецПопытки;
		КонецЕсли;
	КонецЦикла;
	
	// Установим пометку удаления у неактуальных писем.
	Для Каждого НеактуальноеПисьмо Из ТаблицаНеактуальныхПисем Цикл
		НачатьТранзакцию();
		Попытка
			НеактуальноеПисьмоОбъект = НеактуальноеПисьмо.Ссылка.ПолучитьОбъект();
			НеактуальноеПисьмоОбъект.УстановитьПометкуУдаления(Истина);
			НеактуальноеПисьмоОбъект.Записать();
			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьСтатусыПисемРассылки(Рассылка) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
	                      |	ЕСТЬNULL(CRM_СтатусыПисемEmailРассылки.Статус, ПредметыПапкиВзаимодействий.Взаимодействие.СтатусПисьма) КАК Статус
	                      |ИЗ
	                      |	РегистрСведений.ПредметыПапкиВзаимодействий КАК ПредметыПапкиВзаимодействий
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.CRM_СтатусыПисемEmailРассылки КАК CRM_СтатусыПисемEmailРассылки
	                      |		ПО ПредметыПапкиВзаимодействий.Взаимодействие = CRM_СтатусыПисемEmailРассылки.Письмо
	                      |ГДЕ
	                      |	ПредметыПапкиВзаимодействий.Предмет = &Рассылка");
	
	Запрос.УстановитьПараметр("Рассылка", Рассылка);
	СписокСтатусов = Новый СписокЗначений;
	Результат = Запрос.Выполнить().Выгрузить();
	СписокСтатусов.ЗагрузитьЗначения(Результат.ВыгрузитьКолонку("Статус"));
	Возврат СписокСтатусов;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СоздатьЗаполнитьЭлектронноеПисьмоИсходящее(Рассылка, СтрокаПолучателя, ТаблицаАвтотекста)

	НовоеЭлектронноеПисьмо = Документы.ЭлектронноеПисьмоИсходящее.СоздатьДокумент();

	НовоеЭлектронноеПисьмо.Дата                      = CRM_ОбщегоНазначенияСервер.ПолучитьТекущуюДатуСеанса();

	НовоеЭлектронноеПисьмо.УчетнаяЗапись			= Рассылка.УчетнаяЗапись;
	НовоеЭлектронноеПисьмо.ОтправительПредставление	= Рассылка.ОтправительПредставление;

	НовоеЭлектронноеПисьмо.Ответственный			= Рассылка.Ответственный;
	НовоеЭлектронноеПисьмо.Автор					= Пользователи.ТекущийПользователь();
	НовоеЭлектронноеПисьмо.Важность					= Рассылка.Важность;
	НовоеЭлектронноеПисьмо.Тема						= ВернутьТему(Рассылка.Тема, ДанныеФормированияТекстаПисьма(СтрокаПолучателя), ТаблицаАвтотекста);
	НовоеЭлектронноеПисьмо.СтатусПисьма				= Перечисления.СтатусыИсходящегоЭлектронногоПисьма.Черновик;

	НовоеЭлектронноеПисьмо.CRM_ИзHTMLФайла			= Рассылка.ИзHTMLФайла;

	НовоеЭлектронноеПисьмо.Кодировка				= Рассылка.Кодировка;
	Если ПустаяСтрока(НовоеЭлектронноеПисьмо.Кодировка) Тогда
		НовоеЭлектронноеПисьмо.Кодировка			= "utf-8";
	КонецЕсли;

	НовоеЭлектронноеПисьмо.ТипТекста				= Рассылка.ТипТекста;

	Если ПолучитьФункциональнуюОпцию("CRM_НеСохранятьТекстыПисемРассылок") Тогда
		НовоеЭлектронноеПисьмо.CRM_ТекстИзРассылки = Истина;
		НовоеЭлектронноеПисьмо.CRM_РазрешеноРедактирование = Ложь;
	Иначе
		ИтоговыйТекстПисьма = СформироватьТекстПисьмаПолучателю(Рассылка.ТекстHTML, ДанныеФормированияТекстаПисьма(СтрокаПолучателя), ТаблицаАвтотекста);
		НовоеЭлектронноеПисьмо.Текст					= ИтоговыйТекстПисьма;
		НовоеЭлектронноеПисьмо.ТекстHTML				= ИтоговыйТекстПисьма;
	КонецЕсли;

	НовоеЭлектронноеПисьмо.СписокПолучателейПисьма = СтрокаПолучателя.ПредставлениеАдреса;

	НоваяСтрокаПолучателей = НовоеЭлектронноеПисьмо.ПолучателиПисьма.Добавить();

	НоваяСтрокаПолучателей.Адрес         = СтрокаПолучателя.Адрес;
	НоваяСтрокаПолучателей.Представление = СтрокаПолучателя.КонтактноеЛицо;
	НоваяСтрокаПолучателей.Контакт       = СтрокаПолучателя.Партнер;
	Если ЗначениеЗаполнено(СтрокаПолучателя.ПартнерСтрокой) Тогда
		НоваяСтрокаПолучателей.Представление       = СтрокаПолучателя.ПартнерСтрокой;
	КонецЕсли;

	НовоеЭлектронноеПисьмо.ЕстьВложения = Рассылка.ЕстьВложения;

	Возврат НовоеЭлектронноеПисьмо;

КонецФункции

Функция ДанныеФормированияТекстаПисьма(ИсходнаяСтруктура)
	
	Результат = ИсходнаяСтруктура;
	
	Если ТипЗнч(ИсходнаяСтруктура.Партнер) = Тип("СправочникСсылка.Пользователи")
		И ЗначениеЗаполнено(ИсходнаяСтруктура.Партнер.ФизическоеЛицо) Тогда
	
		ДанныеФормированияТекстаПисьма = Новый Структура;
		
		Если ТипЗнч(ИсходнаяСтруктура) = Тип("Структура") Тогда
			
			Для Каждого ЭлементКоллекции Из ИсходнаяСтруктура Цикл
				ДанныеФормированияТекстаПисьма.Вставить(ЭлементКоллекции.Ключ, ЭлементКоллекции.Значение);
			КонецЦикла;
			
		ИначеЕсли ТипЗнч(ИсходнаяСтруктура) = Тип("СтрокаТаблицыЗначений") Тогда
			
			ТаблицаВладелецСтроки = ИсходнаяСтруктура.Владелец();		
			
			Для Каждого Колонка Из ТаблицаВладелецСтроки.Колонки Цикл
				ДанныеФормированияТекстаПисьма.Вставить(Колонка.Имя, ИсходнаяСтруктура[Колонка.Имя]);
			КонецЦикла;
			
		КонецЕсли;
		
		// Переопределение пользователя на его физическое лицо для корректной работы шаблонов автотекста:
		ДанныеФормированияТекстаПисьма.Партнер = ДанныеФормированияТекстаПисьма.Партнер.ФизическоеЛицо;
		
		Результат = ДанныеФормированияТекстаПисьма;
		
	КонецЕсли;
	
	Возврат Результат;

КонецФункции

Функция ПолучитьТаблицуАвтотекста()
	ТаблицаАвтотекста = Новый ТаблицаЗначений;
	ТаблицаАвтотекста.Колонки.Добавить("Тэг");
	ТаблицаАвтотекста.Колонки.Добавить("ИмяКоманды");
	ТаблицаАвтотекста.Колонки.Добавить("ЗаголовокКоманды");
	ТаблицаАвтотекста.Колонки.Добавить("Действие");
	ТаблицаАвтотекста.Колонки.Добавить("ТэгLAT");
	CRM_АвтотекстПереопределяемый.СформироватьСписокАвтотекста(ТаблицаАвтотекста, 
		ОбщегоНазначения.ИдентификаторОбъектаМетаданных(Тип("ДокументСсылка.ЭлектронноеПисьмоИсходящее")),,,Истина);
	CRM_АвтотекстПереопределяемый.СформироватьСписокАвтотекста(ТаблицаАвтотекста, 
		ОбщегоНазначения.ИдентификаторОбъектаМетаданных(Тип("ДокументСсылка.ЭлектронноеПисьмоИсходящее")),, Истина, Истина);
	Возврат ТаблицаАвтотекста;
КонецФункции

Функция ВыполнитьОтправку(ЭлектронноеПисьмо, СервисРассылки, ПараметрыСервиса=Неопределено)
	
	ЭлектронноеПисьмоОбъект = ЭлектронноеПисьмо.ПолучитьОбъект();
	Попытка
		ПараметрыПисьма = CRM_Взаимодействия.ПараметрыПисьмаДляОтправки(ЭлектронноеПисьмоОбъект);
		Если СервисРассылки = Справочники.CRM_СервисыРассылок.SMTP Тогда
			ИдентификаторПисьма = CRM_Взаимодействия.ВыполнитьОтправкуПисьма(ЭлектронноеПисьмоОбъект,, ПараметрыПисьма);
		ИначеЕсли ЗначениеЗаполнено(СервисРассылки) Тогда
			ТекстОшибки = "";
			ИдентификаторПисьма = CRM_ИнтеграцияССервисамиРассылок.ВыполнитьОтправкуПисьма(ЭлектронноеПисьмоОбъект, ПараметрыПисьма, ПараметрыСервиса,  ТекстОшибки);
			Если ЗначениеЗаполнено(ИдентификаторПисьма) Тогда
				Если ТипЗнч(ИдентификаторПисьма) = Тип("ПеречислениеСсылка.CRM_СтатусыПисемEmailРассылки") Тогда
					ЗаписьСтатуса = РегистрыСведений.CRM_СтатусыПисемEmailРассылки.СоздатьМенеджерЗаписи();
					ЗаписьСтатуса.Письмо = ЭлектронноеПисьмо;
					ЗаписьСтатуса.Статус = ИдентификаторПисьма;
					ЗаписьСтатуса.СтатусСтрокой = ТекстОшибки;
					ЗаписьСтатуса.Записать();
					ВызватьИсключение ТекстОшибки;
				Иначе
					ЗаписьСтатуса = РегистрыСведений.CRM_СтатусыПисемEmailРассылки.СоздатьМенеджерЗаписи();
					ЗаписьСтатуса.Письмо = ЭлектронноеПисьмо;
					ЗаписьСтатуса.Статус = Перечисления.CRM_СтатусыПисемEmailРассылки.Отправляется;
					ЗаписьСтатуса.Записать();
				КонецЕсли;
			Иначе
				ЗаписьСтатуса = РегистрыСведений.CRM_СтатусыПисемEmailРассылки.СоздатьМенеджерЗаписи();
				ЗаписьСтатуса.Письмо = ЭлектронноеПисьмо;
				ЗаписьСтатуса.Статус = Перечисления.CRM_СтатусыПисемEmailРассылки.ОшибкаОтправки;
				ЗаписьСтатуса.СтатусСтрокой = ТекстОшибки;
				ЗаписьСтатуса.Записать();
				ВызватьИсключение ТекстОшибки;
			КонецЕсли;
			ЭлектронноеПисьмоОбъект.ИдентификаторСообщения = ИдентификаторПисьма;
		КонецЕсли;
	Исключение
		// Если не удалось отправить Письмо, добавим информацию об этом в РС CRM_НеОтправленныеПисьма.
		ТекстОшибки = ИнформацияОбОшибке();
		CRM_УправлениеЭлектроннойПочтой.ДобавитьЗаписьОНеотправленномПисьме(ЭлектронноеПисьмо, ИнформацияОбОшибке().Описание);
		Возврат ОписаниеОшибки();
	КонецПопытки;
	
	ЭлектронноеПисьмоОбъект.СтатусПисьма = ПредопределенноеЗначение("Перечисление.СтатусыИсходящегоЭлектронногоПисьма.Отправлено");
	ЭлектронноеПисьмоОбъект.ДатаОтправления = CRM_ОбщегоНазначенияСервер.ПолучитьТекущуюДатуСеанса();
	ЭлектронноеПисьмоОбъект.Записать(РежимЗаписиДокумента.Запись);
	Взаимодействия.УстановитьПапкуЭлектронногоПисьма(ЭлектронноеПисьмоОбъект.Ссылка, 
										CRM_УправлениеЭлектроннойПочтой.ПолучитьПапкуЭлектронногоПисьма(ЭлектронноеПисьмо.УчетнаяЗапись,Перечисления.CRM_ВидыПапокЭлектроннойПочты.Отправленные));
	
	// Проверим нет ли записи в РС CRM_НеОтправленныеПисьма по этому письму
	// если есть, то удалим.
	CRM_УправлениеЭлектроннойПочтой.УдалитьЗаписьОНеотправленномПисьме(ЭлектронноеПисьмоОбъект.Ссылка);
	Возврат "";
	
КонецФункции

Функция СформироватьТаблицуПолучателей(Рассылка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	CRM_РассылкаЭлектронныхПисемПолучатели.НомерСтроки,
	|	ВЫБОР
	|		КОГДА CRM_РассылкаЭлектронныхПисемПолучатели.Принадлежность
	|			ТОГДА CRM_РассылкаЭлектронныхПисемПолучатели.КонтактноеЛицо
	|		ИНАЧЕ CRM_РассылкаЭлектронныхПисемПолучатели.Партнер
	|	КОНЕЦ КАК Партнер,
	|	CRM_РассылкаЭлектронныхПисемПолучатели.КонтактноеЛицо,
	|	CRM_РассылкаЭлектронныхПисемПолучатели.Адрес,
	|	CRM_РассылкаЭлектронныхПисемПолучатели.ПредставлениеАдреса,
	|	CRM_РассылкаЭлектронныхПисемПолучатели.ПартнерСтрокой
	|ИЗ
	|	Документ.CRM_РассылкаЭлектронныхПисем.Получатели КАК CRM_РассылкаЭлектронныхПисемПолучатели
	|ГДЕ
	|	CRM_РассылкаЭлектронныхПисемПолучатели.Ссылка.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Рассылка);
	Возврат Запрос.Выполнить().Выгрузить();
		
КонецФункции

Функция СформироватьТекстПисьмаПолучателю(CRM_Объект_ТекстHTML, СтрокаТаблицы, ТаблицаАвтотекста)
	
	РедактируемыйТекст = CRM_Объект_ТекстHTML;
	Для Каждого СтрокаАвтотекста Из ТаблицаАвтотекста Цикл
		
		Если Найти(РедактируемыйТекст, СтрокаАвтотекста.Тэг) > 0 Тогда
			Если СтрокаАвтотекста.Тэг = "%АДРЕС_WEB_ДОСТУПА%" Тогда
				WEbДоступ = Константы.CRM_АдресWebДоступа.Получить();
				Если НЕ ЗначениеЗаполнено(WEbДоступ) Тогда
					СтрокаWEBДоступа = "{адрес web-доступа в настройках системы не заполнен}";
				Иначе
					СтрокаWEBДоступа = "<a target='_blank' href='" + WEbДоступ + "'>Адрес web-доступа</a>";					
				КонецЕсли;
				РедактируемыйТекст = СтрЗаменить(РедактируемыйТекст, СтрокаАвтотекста.Тэг, СтрокаWEBДоступа);
				Продолжить;
			КонецЕсли;
			ЗначениеТэга = CRM_АвтотекстПереопределяемый.ПолучитьЗначениеТэга(СтрокаАвтотекста, СтрокаТаблицы);
			РедактируемыйТекст = СтрЗаменить(РедактируемыйТекст, СтрокаАвтотекста.Тэг, ЗначениеТэга);
		КонецЕсли;
		Если ЗначениеЗаполнено(СтрокаАвтотекста.ТэгLAT) И Найти(РедактируемыйТекст, СтрокаАвтотекста.ТэгLAT) > 0 Тогда
			ЗначениеТэга = CRM_АвтотекстПереопределяемый.ПолучитьЗначениеТэга(СтрокаАвтотекста, СтрокаТаблицы);
			РедактируемыйТекст = СтрЗаменить(РедактируемыйТекст, СтрокаАвтотекста.ТэгLAT, ЗначениеТэга);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат РедактируемыйТекст;
	
КонецФункции

Функция ВернутьТему(ОбъектТема, СтрокаТаблицы, ТаблицаАвтотекста)
	
	РедактируемыйТекст = ОбъектТема;
	Для Каждого СтрокаАвтотекста Из ТаблицаАвтотекста Цикл
		
		Если Найти(РедактируемыйТекст, СтрокаАвтотекста.Тэг) > 0 Тогда
			Если СтрокаАвтотекста.Тэг = "%АДРЕС_WEB_ДОСТУПА%" Тогда
				WEbДоступ = Константы.CRM_АдресWebДоступа.Получить();
				Если НЕ ЗначениеЗаполнено(WEbДоступ) Тогда
					СтрокаWEBДоступа = "{адрес web-доступа в настройках системы не заполнен}";
				Иначе
					СтрокаWEBДоступа = "<a target='_blank' href='" + WEbДоступ + "'>Адрес web-доступа</a>";					
				КонецЕсли;
				РедактируемыйТекст = СтрЗаменить(РедактируемыйТекст, СтрокаАвтотекста.Тэг, СтрокаWEBДоступа);
				Продолжить;
			КонецЕсли;
			ЗначениеТэга = CRM_АвтотекстПереопределяемый.ПолучитьЗначениеТэга(СтрокаАвтотекста, СтрокаТаблицы);
			РедактируемыйТекст = СтрЗаменить(РедактируемыйТекст, СтрокаАвтотекста.Тэг, ЗначениеТэга);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат РедактируемыйТекст;
	
КонецФункции

#КонецОбласти

#КонецЕсли
